tidb-cluster/tests/sysbench/point_select_run_100.log
sysbench 1.0.19 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 100
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 100 tps: 7265.31 qps: 7265.31 (r/w/o: 7265.31/0.00/0.00) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 100 tps: 7316.01 qps: 7316.01 (r/w/o: 7316.01/0.00/0.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 100 tps: 7286.94 qps: 7286.94 (r/w/o: 7286.94/0.00/0.00) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 100 tps: 7105.33 qps: 7105.33 (r/w/o: 7105.33/0.00/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 100 tps: 7103.06 qps: 7103.06 (r/w/o: 7103.06/0.00/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 100 tps: 7065.37 qps: 7065.37 (r/w/o: 7065.37/0.00/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 100 tps: 7174.69 qps: 7174.69 (r/w/o: 7174.69/0.00/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 100 tps: 7180.38 qps: 7180.38 (r/w/o: 7180.38/0.00/0.00) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 100 tps: 7132.61 qps: 7132.61 (r/w/o: 7132.61/0.00/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 100 tps: 7178.77 qps: 7178.77 (r/w/o: 7178.77/0.00/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 100 tps: 7211.82 qps: 7211.82 (r/w/o: 7211.82/0.00/0.00) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 100 tps: 7346.62 qps: 7346.62 (r/w/o: 7346.62/0.00/0.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 100 tps: 7339.69 qps: 7339.69 (r/w/o: 7339.69/0.00/0.00) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 100 tps: 7379.73 qps: 7379.73 (r/w/o: 7379.73/0.00/0.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 100 tps: 7410.38 qps: 7410.38 (r/w/o: 7410.38/0.00/0.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 100 tps: 7345.92 qps: 7345.92 (r/w/o: 7345.92/0.00/0.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 100 tps: 7357.45 qps: 7357.45 (r/w/o: 7357.45/0.00/0.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 100 tps: 7335.39 qps: 7335.39 (r/w/o: 7335.39/0.00/0.00) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 100 tps: 7199.75 qps: 7199.75 (r/w/o: 7199.75/0.00/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 100 tps: 7128.33 qps: 7128.33 (r/w/o: 7128.33/0.00/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 100 tps: 7327.04 qps: 7327.04 (r/w/o: 7327.04/0.00/0.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 100 tps: 7113.50 qps: 7113.50 (r/w/o: 7113.50/0.00/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 100 tps: 7204.88 qps: 7204.88 (r/w/o: 7204.88/0.00/0.00) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 100 tps: 7257.96 qps: 7257.96 (r/w/o: 7257.96/0.00/0.00) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 100 tps: 7241.62 qps: 7241.62 (r/w/o: 7241.62/0.00/0.00) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 100 tps: 7317.00 qps: 7317.00 (r/w/o: 7317.00/0.00/0.00) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 100 tps: 6344.71 qps: 6344.71 (r/w/o: 6344.71/0.00/0.00) lat (ms,95%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 100 tps: 5044.12 qps: 5044.12 (r/w/o: 5044.12/0.00/0.00) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 100 tps: 6918.43 qps: 6918.43 (r/w/o: 6918.43/0.00/0.00) lat (ms,95%): 24.83 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2136959
        write:                           0
        other:                           0
        total:                           2136959
    transactions:                        2136959 (7122.45 per sec.)
    queries:                             2136959 (7122.45 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0298s
    total number of events:              2136959

Latency (ms):
         min:                                    1.03
         avg:                                   14.04
         max:                                   94.91
         95th percentile:                       24.38
         sum:                             29996372.58

Threads fairness:
    events (avg/stddev):           21369.5900/49.62
    execution time (avg/stddev):   299.9637/0.01