tidb-cluster/tests/sysbench/point_select_run_100_3.log
sysbench 1.0.19 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 100
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 100 tps: 7087.62 qps: 7087.62 (r/w/o: 7087.62/0.00/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 100 tps: 6929.96 qps: 6929.96 (r/w/o: 6929.96/0.00/0.00) lat (ms,95%): 25.28 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 100 tps: 6153.53 qps: 6153.53 (r/w/o: 6153.53/0.00/0.00) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 100 tps: 6862.89 qps: 6862.89 (r/w/o: 6862.89/0.00/0.00) lat (ms,95%): 25.28 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 100 tps: 7197.32 qps: 7197.32 (r/w/o: 7197.32/0.00/0.00) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 100 tps: 7223.97 qps: 7223.97 (r/w/o: 7223.97/0.00/0.00) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 100 tps: 7325.29 qps: 7325.29 (r/w/o: 7325.29/0.00/0.00) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 100 tps: 7379.18 qps: 7379.18 (r/w/o: 7379.18/0.00/0.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 100 tps: 7411.44 qps: 7411.44 (r/w/o: 7411.44/0.00/0.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 100 tps: 7389.95 qps: 7389.95 (r/w/o: 7389.95/0.00/0.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 100 tps: 7271.65 qps: 7271.65 (r/w/o: 7271.65/0.00/0.00) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 100 tps: 7391.84 qps: 7391.84 (r/w/o: 7391.84/0.00/0.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 100 tps: 7221.46 qps: 7221.46 (r/w/o: 7221.46/0.00/0.00) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 100 tps: 6506.49 qps: 6506.49 (r/w/o: 6506.49/0.00/0.00) lat (ms,95%): 27.66 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 100 tps: 7388.21 qps: 7388.21 (r/w/o: 7388.21/0.00/0.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 100 tps: 6729.58 qps: 6729.58 (r/w/o: 6729.58/0.00/0.00) lat (ms,95%): 26.20 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 100 tps: 6670.19 qps: 6670.19 (r/w/o: 6670.19/0.00/0.00) lat (ms,95%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 100 tps: 7019.62 qps: 7019.62 (r/w/o: 7019.62/0.00/0.00) lat (ms,95%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 100 tps: 7115.11 qps: 7115.11 (r/w/o: 7115.11/0.00/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 100 tps: 7155.97 qps: 7155.97 (r/w/o: 7155.97/0.00/0.00) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 100 tps: 7085.49 qps: 7085.49 (r/w/o: 7085.49/0.00/0.00) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 100 tps: 7178.00 qps: 7178.00 (r/w/o: 7178.00/0.00/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 100 tps: 7136.52 qps: 7136.52 (r/w/o: 7136.52/0.00/0.00) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 100 tps: 7084.21 qps: 7084.21 (r/w/o: 7084.21/0.00/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 100 tps: 6837.57 qps: 6837.57 (r/w/o: 6837.57/0.00/0.00) lat (ms,95%): 25.28 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 100 tps: 6926.19 qps: 6926.19 (r/w/o: 6926.19/0.00/0.00) lat (ms,95%): 25.28 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 100 tps: 6701.45 qps: 6701.45 (r/w/o: 6701.45/0.00/0.00) lat (ms,95%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 100 tps: 6926.90 qps: 6926.90 (r/w/o: 6926.90/0.00/0.00) lat (ms,95%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 100 tps: 6939.74 qps: 6939.74 (r/w/o: 6939.74/0.00/0.00) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 100 tps: 6977.16 qps: 6977.16 (r/w/o: 6977.16/0.00/0.00) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2112403
        write:                           0
        other:                           0
        total:                           2112403
    transactions:                        2112403 (7040.42 per sec.)
    queries:                             2112403 (7040.42 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0375s
    total number of events:              2112403

Latency (ms):
         min:                                    0.87
         avg:                                   14.20
         max:                                  148.78
         95th percentile:                       24.38
         sum:                             29995300.38

Threads fairness:
    events (avg/stddev):           21124.0300/51.50
    execution time (avg/stddev):   299.9530/0.02